
  # Задача 2
# Напишите  функцию, которая возвращает True, если введенный текст читается одинаково слево-направо и
# справа-налево. Иначе - False

# x = input("Введите текст:")
# reverse = x[::-1]
# def proverka(x):
#     while True:
#         if x[::1] == reverse:
#             return True
#
#         if x != reverse:
#             return False
#
# print(proverka(x))
